import React from "react";
import { Collapse } from "antd";

function CollapsePart({ model }) {
  const items =
    model === 1
      ? [
          {
            key: "1",
            label: "ایا امکان خرید و پرداخت انلاین وجود دارد؟",
            children: (
              <p className="text-white leading-[26px]">
                بله, شما در سایت امکان مشاهده تمامی محصولات را دارید و میتوانید
                با برسی محصول مورد نظر محصول خود را انتخاب کنید و ان را از طریق
                درگاه پرداخت انلاین با تمامی کارت های عضو شتاب پرداخت کنید
              </p>
            ),
          },
          {
            key: "2",
            label: "چگونه میتوانیم با شما در ارتباط باشیم؟",
            children: (
              <p className="text-white leading-[26px]">
                شما هم از طریق فرم بالا میتوانید به ما پیغامی ارسال کنید ک
                کارشناسان ما در سریع ترین زمان ممکن پاسخگویه شما هستن یا از طریق
                شبکه های اجتماعی با ما در ارتباط باشید
              </p>
            ),
          },
        ]
      : [
          {
            key: "1",
            label: "درباره عاشقان گل",
            children: (
              <p className="text-white leading-[26px]">
                تجربه‌ای به قدمت چهار نسل و ارتباط مستمر با مصرف کنندگان ضامن
                این ویژگی‌هاست. از ویژگی‌های بارز مجموعه عاشقان گل واردات مواد
                اولین گل ها به وسیله مدیریت مجموعه و انتخاب بهترین روش وادرات
                جهت توضیع گل است. مجموعه عاشقان گل اولین مجموعه مرتبط با گل در
                ایران است که در سال 2007 به عضویت انجمن تخصصی گل اروپا در آمده
                است.
              </p>
            ),
          },
          {
            key: "2",
            label: "تجربه عاشقان گل",
            children: (
              <p className="text-white leading-[26px]">
                تجربه‌ای به قدمت چهار نسل و ارتباط مستمر با مصرف کنندگان ضامن
                این ویژگی‌هاست. از ویژگی‌های بارز مجموعه عاشقان گل واردات مواد
                اولیه راسا به وسیله مدیریت مجموعه و انتخاب بهترین مواد اولیه جهت
                تولید گل است. مجموعه عاشقان گل اولین مجموعه مرتبط با گل در ایران
                است که در سال 2007 به عضویت انجمن تخصصی گل اروپا در آمده است و
                بسیاری از دوره‌های مربوط به فرآوری گل را مدیریت این مجموعه به
                صورت تخصصی در کارگاه‌های آموزشی این انجمن و همچنین کارگاه‌های
                تخصصی فرآوری گل به خصوص در زمینه بو دادن گل را در کشور آمریکا که
                از پیشگامان این صنعت است را گذرانده است. اکنون با پشتوانه
                دستاوردهای گذشته و تکنولوژی روز دنیا وارد مرحله تولید گل به صورت
                صنعتی و گسترده شده‌ایم و مفتخریم اعلام کنیم که «عاشقان گل» از
                این پس یک نام تجاری صنعتی در صنعت گل ایران است مسیری را که
                بنیان‌گذاران «عاشقان گل» در دهه 20 شمسی آغاز کرده‌اند اکنون وارد
                مرحله جدیدی شده است و مفتخریم اعلام کنیم در بهمن ماه 94 موفق به
                اخذ مجوزهای مربوطه از وزارت بهداشت درمان و آموزش پزشکی و سازمان
                غذا دارو شده‌ایم و تولید سنتی و محدود گل را تبدیل به تولید صنعتی
                و انبوه کرده‌ایم. از دیگر افتخارات مجموعه «عاشقان گل» اخذ مدرک
                دیپلم دانش گل از انجمن گل تخصصی اروپا در فروردین ماه سال 95 است.
                امید داریم با کسب دانش روز دنیا در این صنعت ارتقا کیفیت و تنوع
                محصول در حد استانداردهای جهانی را در آینده‌ای نزدیک شاهد باشیم.
              </p>
            ),
          },
        ];

  return (
    <div className="mx-auto w-full desktop:w-1/2 laptop:w-1/2 mobile:w-full tablet:w-[80%]">
      <Collapse accordion items={items} />
    </div>
  );
}

export default CollapsePart;
